using System;

namespace Jungol
{
    // 613	구조체 - 자가진단1
    // 614	구조체 - 자가진단2
    // 615	구조체 - 자가진단3
    // 616	구조체 - 자가진단4
    // 617	구조체 - 자가진단5
    // 618	구조체 - 자가진단6
    // 195	구조체 - 형성평가1
    // 196	구조체 - 형성평가2
    // 197	구조체 - 형성평가3
    // 198	구조체 - 형성평가4
    // 199	구조체 - 형성평가5
    static class Structure
	{
		
		public static void Test()
        {
            Util.Call(_613);
            Util.Call(_614);
            Util.Call(_615);
            Util.Call(_616);
            Util.Call(_617);
            Util.Call(_618);
            Util.Call(_195);
            Util.Call(_196);
            Util.Call(_197);
            Util.Call(_198);
            Util.Call(_199);
        }

        //--------------------------------------------------
        // 613	구조체 - 자가진단1
        //
        //
        //
        // 입력 예 :
        //
        //
        // 출력 예 :
        //
        //
        //--------------------------------------------------
        static void _613()
        {
            Console.WriteLine("==== NOT IMPLEMENTED");
        }



        //--------------------------------------------------
        // 614	구조체 - 자가진단2
        //
        //
        //
        // 입력 예 :
        //
        //
        // 출력 예 :
        //
        //
        //--------------------------------------------------
        static void _614()
        {
            Console.WriteLine("==== NOT IMPLEMENTED");
        }



        //--------------------------------------------------
        // 615	구조체 - 자가진단3
        //
        //
        //
        // 입력 예 :
        //
        //
        // 출력 예 :
        //
        //
        //--------------------------------------------------
        static void _615()
        {
            Console.WriteLine("==== NOT IMPLEMENTED");
        }



        //--------------------------------------------------
        // 616	구조체 - 자가진단4
        //
        //
        //
        // 입력 예 :
        //
        //
        // 출력 예 :
        //
        //
        //--------------------------------------------------
        static void _616()
        {
            Console.WriteLine("==== NOT IMPLEMENTED");
        }



        //--------------------------------------------------
        // 617	구조체 - 자가진단5
        //
        //
        //
        // 입력 예 :
        //
        //
        // 출력 예 :
        //
        //
        //--------------------------------------------------
        static void _617()
        {
            Console.WriteLine("==== NOT IMPLEMENTED");
        }



        //--------------------------------------------------
        // 618	구조체 - 자가진단6
        //
        //
        //
        // 입력 예 :
        //
        //
        // 출력 예 :
        //
        //
        //--------------------------------------------------
        static void _618()
        {
            Console.WriteLine("==== NOT IMPLEMENTED");
        }



        //--------------------------------------------------
        // 195	구조체 - 형성평가1
        //
        //
        //
        // 입력 예 :
        //
        //
        // 출력 예 :
        //
        //
        //--------------------------------------------------
        static void _195()
        {
            Console.WriteLine("==== NOT IMPLEMENTED");
        }



        //--------------------------------------------------
        // 196	구조체 - 형성평가2
        //
        //
        //
        // 입력 예 :
        //
        //
        // 출력 예 :
        //
        //
        //--------------------------------------------------
        static void _196()
        {
            Console.WriteLine("==== NOT IMPLEMENTED");
        }



        //--------------------------------------------------
        // 197	구조체 - 형성평가3
        //
        //
        //
        // 입력 예 :
        //
        //
        // 출력 예 :
        //
        //
        //--------------------------------------------------
        static void _197()
        {
            Console.WriteLine("==== NOT IMPLEMENTED");
        }



        //--------------------------------------------------
        // 198	구조체 - 형성평가4
        //
        //
        //
        // 입력 예 :
        //
        //
        // 출력 예 :
        //
        //
        //--------------------------------------------------
        static void _198()
        {
            Console.WriteLine("==== NOT IMPLEMENTED");
        }



        //--------------------------------------------------
        // 199	구조체 - 형성평가5
        //
        //
        //
        // 입력 예 :
        //
        //
        // 출력 예 :
        //
        //
        //--------------------------------------------------
        static void _199()
        {
            Console.WriteLine("==== NOT IMPLEMENTED");
        }

    }
}
